# PRATICA INDEPENDENTE Joins com Pandas.

### Considerando os datframes a seguir, criados a partir de dicionários, atenda aos exercícios.

In [84]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'absences': [3, 2, 5, 1]
                   }
                  )
#df1

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]
                   }
                  )
#df2

df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 
                    'supervisor': ['Carly', 'Guido', 'Steve']
                   }
                  )
#df3

#### Exercício 1: Usando a função `.merge()`, obter um dataframe como resultado da intersecão entre `df1` e `df2`.

In [85]:
df_intersecao = df1.merge(df2, on= 'employee')
df_intersecao

  employee        group  absences  hire_date
0      Bob   Accounting         3       2008
1     Jake  Engineering         2       2012
2     Lisa  Engineering         5       2004
3      Sue           HR         1       2014

#### Exercício 2: Calcule também a interseção entre o dataframe criado no exercício anterior e `df3`.

In [86]:
print(df_intersecao)
print('\n')
print(df3)

  employee        group  absences  hire_date
0      Bob   Accounting         3       2008
1     Jake  Engineering         2       2012
2     Lisa  Engineering         5       2004
3      Sue           HR         1       2014


         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [87]:
df_intersecao = df_intersecao.merge(df3, on= 'group')
df_intersecao

  employee        group  absences  hire_date supervisor
0      Bob   Accounting         3       2008      Carly
1     Jake  Engineering         2       2012      Guido
2     Lisa  Engineering         5       2004      Guido
3      Sue           HR         1       2014      Steve

#### Exercício 3: Usando o dataframe `df4` a seguir, gerar um novo dataframe que contenha o resultado dos três anteriores e `df4`.

In [88]:
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']
                   }
                  )
df4

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [93]:
df_intersecao = df_intersecao.join(df4)
df_intersecao

  employee        group  absences  ...  supervisor applier          position
0      Bob   Accounting         3  ...       Carly     Bob               CTO
1     Jake  Engineering         2  ...       Guido    Jake  Senior Developer
2     Lisa  Engineering         5  ...       Guido    Lisa               CFO
3      Sue           HR         1  ...       Steve     Sue        Head of HR

[4 rows x 7 columns]

#### Exercício 4: Usar o método [`.drop()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) para eliminar as colunas redundantes.

In [94]:
df_intersecao.drop(columns= 'applier', inplace= True)
df_intersecao

  employee        group  absences  hire_date supervisor          position
0      Bob   Accounting         3       2008      Carly               CTO
1     Jake  Engineering         2       2012      Guido  Senior Developer
2     Lisa  Engineering         5       2004      Guido               CFO
3      Sue           HR         1       2014      Steve        Head of HR

#### Exercício 5: Agrupe o dataframe do exercício 4 e calcule a contagem de grupos `group` supervisionado por cada supervisor `supervisor`.

In [95]:
df_intersecao.groupby(by= 'supervisor')['group'].value_counts()

supervisor  group
Carly       Accounting     1
Guido       Engineering    2
Steve       HR             1
Name: group, dtype: int64

#### Exercício 6: Usando os DataFrames a seguir, realizar um `inner`, `outer`, `left` e `right` `join` entre eles. Antes de executar cada `join`, escrever um comentário com a saída esperada.

In [96]:
dfA = pd.DataFrame({"a":[1],
                    "b":[2],
                    "c":[3]
                   }
                  )
dfB = pd.DataFrame({"a":[1, 4],
                    "b":[7, 9],
                    "c":[8, 9]
                    }
                  )

In [97]:
print(dfA)
print('\n')
print(dfB)

   a  b  c
0  1  2  3


   a  b  c
0  1  7  8
1  4  9  9

####`.merge()`

O argumento `inner` retorna as chaves dos dataframes passados como argumento. Retorna, nesse caso, as colunas (variáveis) dos dois dataframes com a ordem daquele em que é aplicado a função.

In [98]:
dfA.merge(dfB, how= 'inner')

Empty DataFrame
Columns: [a, b, c]
Index: []

O argumento `outer` retorna um dataframe com as colunas dos dois dataframes e seus respectivos valores (mapeados nos dois dataframes).

In [99]:
dfA.merge(dfB, how= 'outer')

   a  b  c
0  1  2  3
1  1  7  8
2  4  9  9

O argumento `left` retorna dataframe somente com os valores do dataframe em que a função é aplicada.Não considera os valores do dataframe passado como argumento na chamada à função. Nesse caso, retorna somente colunas e valores de dfA.

In [100]:
dfA.merge(dfB, how= 'left')

   a  b  c
0  1  2  3

O argumento `right` é o inverso do `left`. Retorna somente os valores do dataframe à direita, isto é, o dataframe que passamos como argumento dentro dos parênteses na chamada à função.

In [101]:
dfA.merge(dfB, how= 'right')

   a  b  c
0  1  7  8
1  4  9  9

####`.join()`

O argumento `inner` junta os dois dataframes lado a lado com os valores de um mesmo índice. Como nesse caso não temos índice 1 no dfA, ele retorna somente os valores do índice 1 de dfA e dfB justapostos lado a lado.

In [102]:
dfA.join(dfB, how= 'inner', lsuffix='_dfA', rsuffix='_dfB')

   a_dfA  b_dfA  c_dfA  a_dfB  b_dfB  c_dfB
0      1      2      3      1      7      8

O argumento `outer`, por sua vez, retorna uma dataframe completo sem cortar índices. Quando não encontra valores em um índice de algum dataframe em que a função está sendo aplicada, ele os preenche com valores NaN.

In [103]:
dfA.join(dfB, how= 'outer', lsuffix='_dfA', rsuffix='_dfB')

   a_dfA  b_dfA  c_dfA  a_dfB  b_dfB  c_dfB
0    1.0    2.0    3.0      1      7      8
1    NaN    NaN    NaN      4      9      9

O argumento `left` utiliza somente os valores dos índices do dataframe da esquerda, isto é, aquele em que a função é aplicada. Nesse sentido, ele mantém somente os valores dos índices que estão neste dataframe e no segundo ao mesmo tempo.

In [104]:
dfA.join(dfB, how= 'left', lsuffix='_dfA', rsuffix='_dfB')

   a_dfA  b_dfA  c_dfA  a_dfB  b_dfB  c_dfB
0      1      2      3      1      7      8

O argumento `right`, por sua vez, utiliza somente os índices do dataframe da direita, isto é, aquele que está dentro dos parênteses na função. Nesse sentido, ele mantém somente os valores dos índices que estão neste dataframe e no primeiro ao mesmo tempo.

In [105]:
dfA.join(dfB, how= 'left', lsuffix='_dfA', rsuffix='_dfB')

   a_dfA  b_dfA  c_dfA  a_dfB  b_dfB  c_dfB
0      1      2      3      1      7      8